using System;
using System.Linq;

namespace equalSums
{
    class Program
    {
        static void Main(string[] args)
        {
            // Стъпка 1 - Декларираме си масива
            int[] array = Console.ReadLine()
                            .Split()
                            .Select(int.Parse)
                            .ToArray();

            bool isFound = false;

            // Стъпка 2 - Създаваме for цикъл с който ще обходим всички стойности на масива последователно
            // 1 2 3 3 -> започваме с 1.
            for (int curr = 0; curr < array.Length; curr++)
            {
                // Стъпка 3 - проверяваме какъв е сбора на числата в масива от дясно на първата стойност
                
                int rightSum = 0;
                for (int j = curr + 1; j < array.Length; j++)
                {
                    // 1 (в зависимост от curr 1 може да се промени на 2, 3, 3 и т.н) е първата стойност и ние сборуваме 2 + 3 + 3 = 8;
                    rightSum += array[j];
                }

                // Стъпка 4 - проверяваме какъв сбора на числата в масива от ляво на дясно.
                // ако curr е с индекс [3] ние започваме проверката в цикъла с индек [2], за тази цел от curr изваждаме 1 -> curr - 1
                // и минаваме през всички индекси докато не стингем 0 включително.
                int leftSum = 0;
                for (int k = curr - 1; k >= 0 ; k--)
                {
                    // Ако curr е стигнал 3тия индекс от масива [2], ние трябва да проверим къв е сбора на [1] + [0]
                    leftSum += array[k];
                }

                // Стъпка 5 проверяваме дали дясната сума ще бъде равна на лявата
                if (rightSum == leftSum)
                {
                    // ако има такъв случай отпечатваме индекса на който се намира стойността която от ляво сборат и от дясно сборът са равни на конкретната стойност
                    // 1 2 3 3 -> 1+2 =3 (3) 3=3
                    // 0 1 2 3 - индекса на първто 3 е 2
                    // Прекратяваме целия цикъл
                    Console.WriteLine(curr);
                    isFound = true;
                    break;
                }
            }

            // Ако не е намерено такова число isFound си остава false, защото в началото е декларирано така
            // и ще влезе в тази проверка и изпише NO
            if (!isFound)
            {
                Console.WriteLine("no");
            }
        }                   
    }
}
